Revit 2024 API
ScheduleField.VerticalAlignment Property
 The vertical alignment of the column's data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ScheduleVerticalAlignment VerticalAlignment { get; set; }
Visual Basic
Public Property VerticalAlignment As ScheduleVerticalAlignment
	Get
	Set
Visual C++
public:
property ScheduleVerticalAlignment VerticalAlignment {
	ScheduleVerticalAlignment get ();
	void set (ScheduleVerticalAlignment value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace